# Lab1
## Отчет по лабораторной работе № 1

#### № группы: `ПМ-2502`

#### Выполнил: `Гвоздева Ирина Владимировна`

#### Вариант: `3`

### Cодержание:

- [Постановка задачи](#1-постановка-задачи)
- [Входные и выходные данные](#2-входные-и-выходные-данные)
- [Выбор структуры данных](#3-выбор-структуры-данных)
- [Алгоритм](#4-алгоритм)
- [Программа](#5-программа)
- [Анализ правильности решения](#6-анализ-правильности-решения)

### 1. Постановка задачи

> Шарик диаметром X пытаются протащить через последовательность отверстий диаметрами  A, B, C, D. Через какое количество отверстий удастся протащить шарик? На вход программы подаются натуральные числа X, A, B, C, D.

При решении задачи буду считать, что при одинаковом диаметре отверстия и шарика, шарик не проходит через отверстие.
В данной задаче нужно рассмотреть 5 случаев.

1. Шарик не проходит через первое отверстие (X>=A).
2. Шарик проходит через первое отверстие, но не проходит через второе (X<A и X>=B).
3. Шарик проходит через первое и второе отверстия, но не проходит через третье (X<A,B, X>=С).
4. Шарик проходит через первое, второе и третье отверстия, но не проходит через четвертое (X<A,B,C, X>=D).
5. Шарик проходит через все отверстия (X<A,B,C,D).

### 2. Входные и выходные данные

#### Данные на вход

На вход программа должна получать 5 натуральных чисел.

|                                  | Тип         | 
|----------------------------------|-------------|
| X (диаметр шарика)               | Целое число |           
| A (диаметр первого отверстия)    | Целое число | 
| B (диаметр второго отверстия)    | Целое число | 
| C (диаметр третьего отверстия)   | Целое число | 
| D (диаметр четвертого отверстия) | Целое число | 
#### Данные на выход

Программа должна вывести количество отверстий, через которые сможет пройти шарик. Это целое неотрицательное число от 0 до 4. 

|         | Тип                         |
|---------|-----------------------------|
| k       | Целое неотрицательное число |

### 3. Выбор структуры данных

Программа получает 5 целых чисел, обозначающих размеры шарика и отверстий. Для их хранения
можно выделить 5 переменных (`X`, `A`, `B`, `C`, `D`) типа `int`. Для вывода результата необходимо создать отдельную переменную `k` типа `int`.

|                                     | название переменной | Тип (в Java) | 
|-------------------------------------|---------------------|--------------|
| X (диаметр шарика)                  | `X`                 | `int`        |
| A (диаметр первого отверстия)       | `A`                 | `int`        | 
| B (диаметр второго отверстия)       | `B`                 | `int`        |   
| C (диаметр третьего отверстия)      | `C`                 | `int`        | 
| D (диаметр четвертого отверстия)    | `D`                 | `int`        | 
| k (количество пройденных отверстий) | `k`                 | `int`        | 



### 4. Алгоритм

#### Алгоритм выполнения программы:

1. **Ввод данных:**  
   Программа считывает 4 целых числа, обозначенные как `X`, `A`, `B`, `C`, `D`.
   Переменной `k` присваивается значение 0.

3. **Сравнение чисел:**  
   Программа сравнивает значения `X` и `A`. Если `X` больше или равно `A`, программа выводит ответ. В противном случае переменная k увеличивается на 1, и программа продолжает работу.
   Аналогично `X` сравнивается с `B`, `C` и `D`. 
   

5. **Вывод результата:**  
   На экран выводится количество отверстий, через которые смог пройти шарик.

#### Блок-схема

```mermaid
graph TD
    A([Начало]) --> B[/Ввести: X, A, B, C, D/]
    B --> C{X>=A}
    C -- Нет --> D{X>=B}
    D -- Нет --> E{X>=C}
    E -- Нет --> F{X>=D}
    F -- Нет --> H[/k=4/]
    H --> I[/Вывод: 4/]
    C -- Да --> J[/k=0/]
    J --> L[/Вывод: 0/]
    D -- Да --> K[/k=1/]
    K --> M[/Вывод: 1/]
    E -- Да --> G[/k=2/]
    G --> N[/Вывод: 2/]
    F -- Да --> R[/k=3/]
    R --> S[/Вывод: 3/]
    I --> Z
    L --> Z
    M --> Z
    N --> Z
    S --> Z([Конец])

```

### 5. Программа

```java
package org.example;

import java.util.Random;
import java.util.Scanner;

public class Main {
    public static void main(String[] args) {
        // Объявляем объект класса Scanner для ввода данных
        Scanner in = new Scanner(System.in);
        // Считывание пяти целых чисел из консоли
        int X = in.nextInt();
        int A = in.nextInt();
        int B = in.nextInt();
        int C = in.nextInt();
        int D = in.nextInt();
        // Создание переменной-счетчика
        int k = 0;
        // Проверка, проходит ли шарик отверстия. Если не проходит - вывод ответа,
        // если проходит - увелечение k на один и переход к следующему отверстию.
        if (X>=A) {
            System.out.println(k);
        }
        else {
            k++;
            if (X>=B){
                System.out.println(k);}
            else {
                k++;
                if (X>=C){
                    System.out.println(k);}
                else {
                    k++;
                    if (X>=D){
                        System.out.println(k);}
                    else{
                        k++;
                        System.out.println(k);
                    }
                }
            }
        }
    }
}
```

### 6. Анализ правильности решения

Программа работает корректно.

1. Тест на `X > A, B, C, D`:

    - **Input**:
        ```
        10 2 3 5 7 
        ```

    - **Output**:
        ```
        0
        ```

2. Тест на `X <= A, B, C, D`:

    - **Input**:
        ```
        2 4 6 22 3
        ```

    - **Output**:
        ```
        4
        ```

3. Тест на `X < A, X > B, X < C, D`:

    - **Input**:
        ```
        6 8 5 9 12
        ```

    - **Output**:
        ```
        1
        ```

4. Тест на `X = A`:

    - **Input**:
        ```
        5 5 3 7 1
        ```

    - **Output**:
        ```
        0
        ```

